{
    "aboutMe": " I am a vibrant individual with a strong desire for knowledge and a heart full of positivity. You will always find me smiling and joyful. I navigate the world with eager curiosity, always looking for new skills to add to my pockets. During my relentless pursuit of learning, I discovered the fascinating world of coding, and it was love at first code! There's something incredibly exciting about the language of computers and creating digital wonders from just pixels. When I'm not lost in lines of code, you'll likely find me in the kitchen. Cooking isn't just a hobby for me, it's a creative outlet where I sprinkle a dash of passion and a pinch of experimentation into every dish. Oh, and did I mention I'm a linguistic juggler? Fluent in isiXhosa and English. With an infectious enthusiasm, a skillet in one hand, and a keyboard in the other, I'm ready to embark on new adventures, tackle fresh challenges, and sprinkle a little laughter along the way.",
    "projects": [
        {
            "name": "Hulu Clone", 
             "github": "https://github.com/AkhonaMj/hulu_clone",
             "vercel":"https://hulu-clone-owgjn9uoi-akhonas-projects.vercel.app/",
             "image":"https://akhonamj.github.io/portfolio_images/hulu.jpg"
         },
        {
            "name": "Calculator", 
            "github": "https://github.com/AkhonaMj/calculator.git",
            "vercel": "https://calculator-n256ciezx-akhonas-projects.vercel.app",
            "image":"https://akhonamj.github.io/portfolio_images/calc2.png"

        },
        {
            "name": "BMI Calculator", 
            "github": "https://github.com/AkhonaMj/BMI-calculator.git",
            "vercel":"https://bmi-calculator-4553fni4o-akhonas-projects.vercel.app",
            "image":"https://akhonamj.github.io/portfolio_images/bmicalc2.jpg"

        },
        {
            "name": "Ecommerce website", 
            "github": "https://github.com/AkhonaMj/ecommerce-project.git",
            "vercel":"https://ecommerce-project-5kngx7f6y-akhonas-projects.vercel.appp",
            "image":"https://akhonamj.github.io/portfolio_images/ecom.jpg"
        },
        {
           "name": "Temperature Converter", 
            "github": "https://github.com/AkhonaMj/temperature_converter",
            "vercel":"https://temperature-converter-f1qpl4ba6-akhonas-projects.vercel.app/",
            "image":"https://akhonamj.github.io/portfolio_images/tempCon.png"
        },
        {
            "name": "Taxi Queue", 
             "github":"https://github.com/AkhonaMj/taxi-queue-app",
             "vercel":"https://taxi-queue-app.vercel.app/",
             "image":"https://akhonamj.github.io/portfolio_images/taxi3.png"
         }
     
    ],
    
    "education":[
        {
            "description": "High SChool",
            "year":"2014-2018",
            "Institution":"Joe Slovo Engineering High School" 
        },
        {
            "description": "Full-Stack Web Development",
            "year":"Present",
            "Institution":"Life Choices Academy"  
        },
        {
            "description": "Mechanical Engineering",
            "year":"2021",
            "Institution":"Northlink College "
    
        }
    ],
    "skills":{
        "hardSkills":[
        {
            "name":"HTML",
            "image":"https://akhonamj.github.io/portfolio_images/icons8-html-logo-64.png",
            "description":"I use HTML to create the foundational structure of webpages, including defining headings, paragraphs, images, links, and forms. It allows me to build portfolio sites, interactive web applications, and responsive layouts, ensuring content is well-organized and accessible."
        },
        {
            "name":"CSS",
            "image":"https://akhonamj.github.io/portfolio_images/icons8-css-logo-64.png",
            "description":"I use CSS (Cascading Style Sheets) to style and layout webpages. It helps me design visually appealing websites by controlling colors, fonts, spacing, and positioning of elements. With CSS, I create responsive designs that work on various devices, enhance user experience, and bring my HTML structures to life."
        }, 
         {
            "name":"Bootstrap",
            "image":"https://akhonamj.github.io/portfolio_images/icons8-bootstrap-48.png",
            "description":"I use Bootstrap to streamline and enhance web development. Bootstrap is a popular front-end framework that provides pre-styled components and responsive layout utilities. It helps me create modern and consistent designs efficiently, saving time by offering ready-made components like navigation bars, buttons, grids, and forms. This allows me to focus more on functionality and customization while ensuring a responsive and visually appealing user interface."
        },
        {
            "name":"JavaScript",
            "image":"https://akhonamj.github.io/portfolio_images/icons8-javascript-logo-64.png",
            "description":"I use JavaScript to add interactivity and functionality to webpages. JavaScript is a versatile programming language that allows me to manipulate webpage elements, handle user events, perform calculations, and interact with servers (using frameworks like Node.js). It enhances user experience by enabling dynamic content updates and responsive behavior, making web applications more interactive and engaging."
        },
        {
            "name":"Git & Github",
            "image":"https://akhonamj.github.io/portfolio_images/icons8-git-64.png",
            "description":"I use Git for version control, which helps me track changes in my codebase, collaborate with others, and revert to previous versions when needed. GitHub is a platform where I store my Git repositories remotely, enabling me to showcase my projects, collaborate with teams, and contribute to open-source projects. It provides tools for code review, issue tracking, and project management, facilitating efficient development workflows."
        }
    ],
    "softSkills":[
        {
            "name":"Time Management",
            "image":"https://akhonamj.github.io/portfolio_images/icons8-time-management-64%20(2).png",
            "description":"Time management is a crucial skill that I employ to prioritize tasks effectively, set achievable goals, and optimize productivity. It involves planning my schedule, allocating time for different activities, and using techniques like prioritization, delegation, and time blocking to ensure I meet deadlines and maintain work-life balance."
        },
        {
            "name":"Problem Solving",
            "image":"https://akhonamj.github.io/portfolio_images/icons8-problem-solving-64%20(1).png",
            "description":"Problem solving is a key skill I apply to identify issues, analyze root causes, and develop effective solutions. It involves breaking down complex problems into manageable parts, using logical reasoning and creativity to explore different approaches, and implementing strategies to achieve optimal outcomes. Problem solving also includes evaluating results, learning from mistakes, and continuously improving processes to overcome challenges effectively."
        }, 
         {
            "name":"Communication",
            "image":"https://akhonamj.github.io/portfolio_images/icons8-communication-64.png",
            "description":"Communication is essential for conveying ideas, collaborating effectively, and building relationships. I use clear and concise language to articulate concepts, actively listen to others to understand their perspectives, and adapt my communication style to different audiences. Effective communication involves expressing thoughts confidently, asking questions to clarify information, and fostering open dialogue to ensure mutual understanding and successful teamwork."
        },
        {
            "name":"Collaboration",
            "image":"https://akhonamj.github.io/portfolio_images/icons8-collaborating-in-circle-48.png",
            "description":"Collaboration is vital for achieving shared goals and leveraging diverse skills and perspectives. I collaborate by communicating openly, respecting others' contributions, and actively participating in team discussions. I contribute ideas, listen to feedback, and support team members to achieve collective success. Effective collaboration fosters creativity, enhances problem-solving capabilities, and promotes a positive work environment built on trust and mutual respect."
        },
        {
            "name":"Empathy",
            "image":"https://akhonamj.github.io/portfolio_images/icons8-trust-64.png",
            "description":"In professional settings, I practice empathy by listening actively to colleagues and clients, considering their perspectives, and acknowledging their emotions and experiences. By empathizing, I build stronger relationships, improve communication, and foster a supportive and inclusive environment where everyone feels valued and understood."
        }

    ]
},
    "workExp":[
        {
            "placeOfWork":"DecorLab Outtlet",
            "year":"2021-2023",
            "description":"Sales Assistant",
            "Reference":{
                "name":"Mariam Clayton",
                "contact":"0681296676",
                "position":"Manager"
            }
        },
        {
            "placeOfWork":"Moses Mabhida Library",
            "year":"2019",
            "description":"Children's Tutor",
            "contact":{
                "name":"Sinazo Mjacu",
                "contact":"0658379599",
                "position":"Library Assistant"
            }
        }
    ],
    "testimonials":[
        {
            "imageUrl":"https://akhonamj.github.io/portfolio_images/portfolio_cait.jpg",
            "name":"Caitlin Dalwai",
            "relationship":"Colleague",
            "testimony":"Having worked alongside Akhona in our journey at Life Choices Academy I can confidently say that any company who hires her is lucky to have her on board. Akhona is hard working and always determined to find a solution, she never gives up. She is not only intelligent, but also has an energy that can lift up anyones mood."
        },
        {
            "imageUrl":"https://akhonamj.github.io/portfolio_images/Chloe.png",
            "name":"Chloe Smith",
            "relationship":"Colleague",
            "testimony":"Observing Akhona's dedication and progress in our web development course has been truly inspiring. Her commitment to mastering coding and design fundamentals is evident in every task she undertakes. Akhona's tenacity and problem-solving skills shine through as she navigates through the complexities of the course material. Moreover, her positive attitude and willingness to help others create a supportive learning environment. I have no doubt that Akhona's passion and determination will lead her to excel in her web development journey."

        },
        {
            "imageUrl":"https://akhonamj.github.io/portfolio_images/matthew__1_.png",
            "name":"Matthew Brown",
            "relationship":"Lecturer",
            "testimony":"Akhona is an extremely hard working and goal- driven individual. She always strives for excellence and always has found solutions to overcome any challenge."
        },
        {
            "imageUrl":"https://akhonamj.github.io/portfolio_images/Sihlandlo.jpg",
            "name":"Sihlandlo Makhumsha",
            "relationship":"Colleague",
            "testimony":"Having Akhona in your team brings enlightenment.  She's a refreshing soul, and her having a type six enneagram personality benefits the team's objectives as she foresees hurdles and foster cooperation."
        },
        {
            "imageUrl":"https://akhonamj.github.io/portfolio_images/yolanda.jpg",
            "name":"Yolanda Matiwane",
            "relationship":"Colleague",
            "testimony":"Akhona is strong-willed, determinant and intelligent person. She is easy going and relatable which makes working with her a delight. She always manages to keep everyone's spirit up with her bubbly personality, and has impeccable work ethics"
        },
        {
            "imageUrl":"https://akhonamj.github.io/portfolio_images/zizipho.webp",
            "name":"Zizipho Copiso",
            "relationship":"Former Colleague",
            "testimony":"Working with Akhona has been an absolute pleasure! Her exceptional professionalism, combined with her friendly and approachable demeanor, made our collaboration a seamless and enjoyable experience. She is so down to earth, loving, caring, literally gets along with everyone around her. She was the type to always push me to do my best with whatever I did which I appreciate to this day! She was such a great friend and acquantance."
        }
    ]
}